uhnp/src/DataProcessors/тн_СозданиеАвансовыхОтчетовПоБилетам/тн_СозданиеАвансовыхОтчетовПоБилетам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>тн_СозданиеАвансовыхОтчетовПоБилетам</name>
  <comment>//Блинова М.А. 23.01.2026 Выполнение задач №000056362</comment>
  <attributes>
    <name>Период</name>
    <type>
      <types>StandardPeriod</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодотчетноеЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТаблицаДанных</name>
    <attributes>
      <name>Физлицо</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>АвансовыйОтчет</name>
      <type>
        <types>DocumentRef.АвансовыйОтчет</types>
      </type>
    </attributes>
    <attributes>
      <name>Бронирование</name>
      <type>
        <types>DocumentRef.Бронирование</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

uhnp/src/InformationRegisters/ТекущиеКадровыеДанныеСотрудников/ТекущиеКадровыеДанныеСотрудников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ТекущиеКадровыеДанныеСотрудников</name>
  <resources>
    <name>ТекущееПодразделение</name>
    <type>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
    </type>
  </resources>
  <resources>
    <name>ТекущаяДолжность</name>
    <type>
      <types>CatalogRef.Должности</types>
    </type>
  </resources>
  <resources>
    <name>ДатаУвольнения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОсновноеРабочееМестоВОрганизации</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>УдалитьТекущаяДолжностьПоШтатномуРасписанию</name>
    <type>
      <types>CatalogRef.ШтатноеРасписание</types>
    </type>
  </resources>
  <resources>
    <name>ДатаПриема</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ТекущийВидЗанятости</name>
    <type>
      <types>EnumRef.ВидыЗанятости</types>
    </type>
  </resources>
  <resources>
    <name>УдалитьТекущийВидДоговора</name>
    <type>
      <types>EnumRef.ВидыДоговоровССотрудниками</types>
    </type>
  </resources>
  <resources>
    <name>ОформленПоТрудовомуДоговору</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>УдалитьТекущаяТерритория</name>
    <type>
      <types>CatalogRef.ТерриторииВыполненияРабот</types>
    </type>
  </resources>
  <resources>
    <name>КоличествоСтавок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>22</precision>
        <scale>20</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>тнПодразделение</name>
    <comment>Выполнение задач №000041300</comment>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </resources>
  <dimensions>
    <name>ФизическоеЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ГоловнаяОрганизация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТекущаяОрганизация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

uhnp/src/Enums/ТипыОперацийСБилетами/ТипыОперацийСБилетами.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыОперацийСБилетами</name>
  <enumValues>
    <name>Покупка</name>
  </enumValues>
  <enumValues>
    <name>Доплата</name>
  </enumValues>
  <enumValues>
    <name>Возврат</name>
  </enumValues>
  <enumValues>
    <name>тн_ВключениеВАО</name>
    <comment>№000040506</comment>
  </enumValues>
  <enumValues>
    <name>тн_ВключениеВКнигуПокупок</name>
    <comment>№000040506</comment>
  </enumValues>
</mdclass:Enum>

uhnp/src/Enums/СтатусыАвансовогоОтчета/СтатусыАвансовогоОтчета.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыАвансовогоОтчета</name>
  <enumValues>
    <name>Подготовлен</name>
  </enumValues>
  <enumValues>
    <name>Утвержден</name>
  </enumValues>
</mdclass:Enum>

uhnp/src/Enums/ТипыНалогообложенияНДС/ТипыНалогообложенияНДС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыНалогообложенияНДС</name>
  <enumValues>
    <name>НалоговыйАгентПоНДС</name>
  </enumValues>
  <enumValues>
    <name>ПоФактическомуИспользованию</name>
  </enumValues>
  <enumValues>
    <name>ПродажаНаЭкспорт</name>
  </enumValues>
  <enumValues>
    <name>ПродажаНеОблагаетсяНДС</name>
  </enumValues>
  <enumValues>
    <name>ПродажаОблагаетсяЕНВД</name>
  </enumValues>
  <enumValues>
    <name>ПродажаОблагаетсяНДС</name>
  </enumValues>
  <enumValues>
    <name>ЭкспортСырьевыхТоваровУслуг</name>
  </enumValues>
  <enumValues>
    <name>ЭкспортНесырьевыхТоваров</name>
  </enumValues>
  <enumValues>
    <name>ВводОСВЭксплуатацию</name>
  </enumValues>
  <enumValues>
    <name>ОпределяетсяРаспределением</name>
  </enumValues>
  <enumValues>
    <name>ОблагаетсяНДСУПокупателя</name>
  </enumValues>
  <enumValues>
    <name>ПроизводствоСДЦ</name>
  </enumValues>
  <enumValues>
    <name>ЭлектронныеУслуги</name>
  </enumValues>
  <enumValues>
    <name>РеализацияРаботУслугНаЭкспорт</name>
  </enumValues>
  <enumValues>
    <name>ПродажаПоПатенту</name>
  </enumValues>
  <enumValues>
    <name>РеверсивноеОбложениеНДС</name>
  </enumValues>
  <enumValues>
    <name>ОблагаетсяНДССМежценовойРазницы</name>
  </enumValues>
  <enumValues>
    <name>Космос</name>
  </enumValues>
  <enumValues>
    <name>ПродажаОблагаетсяНДСВСтранеЕАЭС</name>
  </enumValues>
  <enumValues>
    <name>ЛьготноеНалогообложениеНДСНаУСН</name>
  </enumValues>
</mdclass:Enum>

uhnp/src/Documents/ЗаписьКнигиПокупок/ЗаписьКнигиПокупок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаписьКнигиПокупок</name>
  <basedOn>Document.ПриобретениеУслугПрочихАктивов</basedOn>
  <registerRecords>AccumulationRegister.ДвиженияПоНДС</registerRecords>
  <registerRecords>InformationRegister.ОперацииСПрослеживаемымиТоварами</registerRecords>
  <registerRecords>InformationRegister.СуммыДокументовВВалютахУчета</registerRecords>
  <registerRecords>InformationRegister.ОперацииСПрослеживаемымиТоварамиРасширенный</registerRecords>
  <registerRecords>InformationRegister.ОтражениеДокументовВРеглУчете</registerRecords>
  <registerRecords>AccumulationRegister.ФактическиеДанныеБюджетирования</registerRecords>
  <registerRecords>AccountingRegister.МеждународныйБезКорреспонденции</registerRecords>
  <registerRecords>AccountingRegister.Хозрасчетный</registerRecords>
  <registerRecords>InformationRegister.ОтражениеДокументовВМеждународномУчете</registerRecords>
  <registerRecords>AccountingRegister.Международный</registerRecords>
  <registerRecords>AccumulationRegister.тн_ЭлектронныеБилетыСотрудников</registerRecords>
  <registerRecords>AccumulationRegister.НДСЗаписиКнигиПокупок</registerRecords>
  <registerRecords>InformationRegister.ЖурналУчетаСчетовФактур</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Организации</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредъявленСчетФактура</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСчетаФактуры</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерСчетаФактуры</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗаписьДополнительногоЛиста</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КорректируемыйПериод</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДокументРасчетов</name>
    <type>
      <types>DefinedType.ОснованиеЗаписиКнигиПокупок</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьСпособКорректировкиНДС</name>
    <type>
      <types>EnumRef.УдалитьСпособыКорректировкиНДС</types>
    </type>
  </attributes>
  <attributes>
    <name>КодВидаОперации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПолучения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПолученВЭлектронномВиде</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.АвансовыйОтчет</types>
      <types>DocumentRef.ПриобретениеУслугПрочихАктивов</types>
    </type>
  </attributes>
  <attributes>
    <name>ИННКонтрагента</name>
    <type>
      <types>DefinedType.ИНН</types>
    </type>
  </attributes>
  <attributes>
    <name>КППКонтрагента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РучнаяКорректировкаЖурналаСФ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>тн_НалогообложениеНДС</name>
    <comment>№000046864</comment>
    <type>
      <types>EnumRef.ТипыНалогообложенияНДС</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Ценности</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидЦенности</name>
      <type>
        <types>EnumRef.ВидыЦенностей</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоПоРНПТ</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>23</precision>
          <scale>11</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>CatalogRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерГТД</name>
      <comment>(Регл) </comment>
      <type>
        <types>CatalogRef.НомераГТД</types>
      </type>
    </attributes>
    <attributes>
      <name>КодТНВЭД</name>
      <type>
        <types>CatalogRef.КлассификаторТНВЭД</types>
      </type>
    </attributes>
    <attributes>
      <name>Событие</name>
      <type>
        <types>EnumRef.СобытияПоНДСПокупки</types>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторСтроки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НаправлениеДеятельности</name>
      <type>
        <types>CatalogRef.НаправленияДеятельности</types>
      </type>
    </attributes>
    <attributes>
      <name>НастройкаСчетовУчета</name>
      <type>
        <types>CatalogRef.НастройкиСчетовУчетаПрочихОпераций</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДокументыОплаты</name>
    <attributes>
      <name>ДатаОплаты</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДокументОплаты</name>
      <type>
        <types>DocumentRef.РасходныйКассовыйОрдер</types>
        <types>DocumentRef.ВозвратТоваровПоставщику</types>
        <types>DocumentRef.СписаниеБезналичныхДенежныхСредств</types>
        <types>DocumentRef.АвансовыйОтчет</types>
        <types>DocumentRef.ВозвратТоваровМеждуОрганизациями</types>
        <types>DocumentRef.ВзаимозачетЗадолженности</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

uhnp/src/DataProcessors/тн_СозданиеАвансовыхОтчетовПоБилетам/Forms/Форма/Module.bsl
&НаСервере
Процедура ЗаполнитьНаСервере(Период, Организация, ПодотчетноеЛицо)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	ДокументБронирования.Ссылка КАК Бронирование,
		|	ДокументБронирования.Сотрудник КАК ФизЛицо
		|ПОМЕСТИТЬ ВТ_Бронирования
		|ИЗ
		|	Документ.Бронирование КАК ДокументБронирования
		|ГДЕ
		|	ДокументБронирования.Организация = &Организация
		|	И ДокументБронирования.ДатаПрибытия МЕЖДУ &ДатаНачала И &ДатаОкончания 
		|   //условие
		|	И НЕ ДокументБронирования.ПометкаУдаления
		|	И ДокументБронирования.Проведен
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	МАКСИМУМ(ИСТИНА) КАК ЕстьВозврат,
		|	БронированиеОперации.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ Возвраты
		|ИЗ
		|	Документ.Бронирование.Операции КАК БронированиеОперации
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Бронирования КАК ВТ_Бронирования
		|		ПО БронированиеОперации.Ссылка = ВТ_Бронирования.Бронирование
		|ГДЕ
		|	БронированиеОперации.ТипОперации = &ТипОперации
		|
		|СГРУППИРОВАТЬ ПО
		|	БронированиеОперации.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	АвансовыйОтчет.Ссылка КАК Ссылка,
		|	АвансовыйОтчет.тн_Бронирование КАК тн_Бронирование
		|ПОМЕСТИТЬ ВТ_АО
		|ИЗ
		|	Документ.АвансовыйОтчет КАК АвансовыйОтчет
		|ГДЕ
		|	АвансовыйОтчет.Проведен
		|	И НЕ АвансовыйОтчет.ПометкаУдаления
		|	И АвансовыйОтчет.Организация = &Организация
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	АвансовыйОтчетПрочиеРасходы.Ссылка,
		|	АвансовыйОтчетПрочиеРасходы.ЭлектронныйБилет
		|ИЗ
		|	Документ.АвансовыйОтчет.ПрочиеРасходы КАК АвансовыйОтчетПрочиеРасходы
		|ГДЕ
		|	АвансовыйОтчетПрочиеРасходы.Ссылка.Проведен
		|	И НЕ АвансовыйОтчетПрочиеРасходы.Ссылка.ПометкаУдаления
		|	И АвансовыйОтчетПрочиеРасходы.Ссылка.Организация = &Организация
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВТ_Бронирования.Бронирование КАК Бронирование,
		|	ВТ_Бронирования.ФизЛицо КАК ФизЛицо,
		|	ВТ_АО.Ссылка КАК АвансовыйОтчет,
		|	ЕСТЬNULL(Возвраты.ЕстьВозврат, ЛОЖЬ) КАК ЕстьВозврат
		|ИЗ
		|	ВТ_Бронирования КАК ВТ_Бронирования
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_АО КАК ВТ_АО
		|		ПО ВТ_Бронирования.Бронирование = ВТ_АО.тн_Бронирование
		|		ЛЕВОЕ СОЕДИНЕНИЕ Возвраты КАК Возвраты
		|		ПО ВТ_Бронирования.Бронирование = Возвраты.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Сторно КАК Сторно
		|		ПО ВТ_Бронирования.Бронирование = Сторно.СторнируемыйДокумент
		|ГДЕ
		|	ВТ_АО.Ссылка ЕСТЬ NULL
		|	И Сторно.Ссылка ЕСТЬ NULL
		|
		|УПОРЯДОЧИТЬ ПО
		|	Бронирование,
		|	ФизЛицо";
	
	Запрос.УстановитьПараметр("ДатаНачала", Период.ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", Период.ДатаОкончания);
	Запрос.УстановитьПараметр("Организация", Организация);   
	Запрос.УстановитьПараметр("ТипОперации", Перечисления.ТипыОперацийСБилетами.Возврат);
	Если ПодотчетноеЛицо  <> Справочники.ФизическиеЛица.ПустаяСсылка() Тогда 
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "//условие", " И ДокументБронирования.Сотрудник = &ПодотчетноеЛицо");
		Запрос.УстановитьПараметр("ПодотчетноеЛицо", ПодотчетноеЛицо);
	КонецЕсли;
	РезультатЗапроса = Запрос.Выполнить();
	
	ТЗБронирований = РезультатЗапроса.Выгрузить();
	Объект.ТаблицаДанных.Очистить();
	Объект.ТаблицаДанных.Загрузить(ТЗБронирований);
	
КонецПроцедуры

&НаСервере
Функция СоздатьДокументыЗаписьКнигиПокупок(Объект)

	МассивЗКП = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	АвансовыйОтчетПрочиеРасходы.НомерСтроки КАК НомерСтроки
	|ИЗ
	|	Документ.АвансовыйОтчет.ПрочиеРасходы КАК АвансовыйОтчетПрочиеРасходы
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаписьКнигиПокупок.Ценности КАК ЗаписьКнигиПокупокЦенности
	|		ПО АвансовыйОтчетПрочиеРасходы.ЭлектронныйБилет = ЗаписьКнигиПокупокЦенности.НастройкаСчетовУчета.Субконто2
	|			И АвансовыйОтчетПрочиеРасходы.Ссылка = ЗаписьКнигиПокупокЦенности.Ссылка.ДокументОснование
	|			И (НЕ ЗаписьКнигиПокупокЦенности.Ссылка.ПометкаУдаления)
	|ГДЕ
	|	АвансовыйОтчетПрочиеРасходы.Ссылка = &Ссылка
	|	И НЕ АвансовыйОтчетПрочиеРасходы.ЭлектронныйБилет = ЗНАЧЕНИЕ(Документ.Бронирование.ПустаяСсылка)
	|	И ЗаписьКнигиПокупокЦенности.Ссылка ЕСТЬ NULL";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		пПосадочный = Документы.ЗаписьКнигиПокупок.СоздатьДокумент();
		ДанныеЗаполнения = Новый Структура;
		ДанныеЗаполнения.Вставить("АвансовыйОтчет", Объект.Ссылка);
		ДанныеЗаполнения.Вставить("АвансовыйОтчетСтрокаПрочиеРасходы", Объект.Ссылка.ПрочиеРасходы.Найти(Выборка.НомерСтроки, "НомерСтроки"));
		пПосадочный.Заполнить(ДанныеЗаполнения);
		Если пПосадочный.Ценности.Количество() Тогда
			пПосадочный.Записать(РежимЗаписиДокумента.Запись);
			МассивЗКП.Добавить(пПосадочный.Ссылка);
			ОбщегоНазначения.СообщитьПользователю("Записан документ: " + пПосадочный.Ссылка, пПосадочный.Ссылка);
		КонецЕсли;
	КонецЦикла;
	
	Возврат МассивЗКП;

КонецФункции

&НаКлиенте
Процедура Заполнить(Команда)
	
	Отказ = Ложь;
	//1. проверяем заполненность параметров 
	Если Не ЗначениеЗаполнено(Объект.Период) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Не заполнен параметр ""Период""");
		Отказ = Истина;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.Организация) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Не заполнен параметр ""Организация""");
		Отказ = Истина;
	КонецЕсли;
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	//2. заполняем
  ЗаполнитьНаСервере(Объект.Период, Объект.Организация, Объект.ПодотчетноеЛицо); 
  
КонецПроцедуры

&НаСервере
Процедура СоздатьАвансовыеОтчетыНаСервере()
	
	Для Каждого СтрокаБронирований Из Объект.ТаблицаДанных Цикл
		Если СтрокаБронирований.Пометка Тогда   
			СтрокаБронирований.АвансовыйОтчет = СоздатьАвансовыйОтчет(СтрокаБронирований.Бронирование, СтрокаБронирований.ФизЛицо);  			
			Если НЕ СтрокаБронирований.АвансовыйОтчет = Документы.АвансовыйОтчет.ПустаяСсылка() Тогда
				СтрокаБронирований.Пометка = Ложь;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;   
	
КонецПроцедуры

&НаСервере
Функция СоздатьАвансовыйОтчет(ДокументБронирование, ФизЛицо);    
	
	АвансовыйОтчет = Документы.АвансовыйОтчет.ПустаяСсылка();
	НачатьТранзакцию();
    
    Попытка
        // Создание документа
        АвансовыйОтчет = Документы.АвансовыйОтчет.СоздатьДокумент();
        
        // Заполнение основной информации  
        АвансовыйОтчет.Дата = ДатаАО(ФизЛицо, ДокументБронирование.ДатаПрибытия);
        АвансовыйОтчет.Статус = Перечисления.СтатусыАвансовогоОтчета.Утвержден;
		// НАЧАЛО Юдина Екатерина 20.04.2026 Выполнение задач №000057395
		//АвансовыйОтчет.ЗакупкаПодДеятельность = Перечисления.ТипыНалогообложенияНДС.ОблагаетсяНДСУПокупателя;
        АвансовыйОтчет.ЗакупкаПодДеятельность = Перечисления.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС;
		// КОНЕЦ Юдина Екатерина 20.04.2026 Выполнение задач №000057395
        АвансовыйОтчет.ЦенаВключаетНДС = Истина;
		ТекущийПользователь = ПользователиКлиентСервер.ТекущийПользователь();
        АвансовыйОтчет.тн_ЛицоСогласования = ТекущийПользователь.ФизическоеЛицо;
        АвансовыйОтчет.тн_Бронирование = ДокументБронирование;
		АвансовыйОтчет.Организация = Объект.Организация;
		АвансовыйОтчет.ПодотчетноеЛицо = ФизЛицо;  
		АвансовыйОтчет.ДатаУтверждения = ДокументБронирование.ДатаПрибытия; 
		АвансовыйОтчет.Валюта = ДокументБронирование.Валюта;
        // Получение подразделения из кадровых данных
        Подразделение = ПолучитьПодразделениеСотрудника(ФизЛицо);
        Если Подразделение <> Неопределено Тогда
            АвансовыйОтчет.Подразделение = Подразделение;
        КонецЕсли;
        
        // Формирование комментария
        АвансовыйОтчет.Комментарий = СтрШаблон("Билет-%1-%2", Формат(ДокументБронирование.ДатаОтправления, "ДФ=dd.MM.yyyy") + "-" + 
							            Формат(ДокументБронирование.ДатаПрибытия, "ДФ=dd.MM.yyyy"), ДокументБронирование.ДеталиПоездки);
        
        // Добавление расходов
       ДобавитьСтрокуПоДаннымБилета(ДокументБронирование, АвансовыйОтчет, Подразделение);
	   
        // Запись и проведение документа
        АвансовыйОтчет.Записать(РежимЗаписиДокумента.Запись);
        
        ЗафиксироватьТранзакцию();
		
    Исключение
        ОтменитьТранзакцию();
        ВызватьИсключение;
	КонецПопытки;
	Возврат АвансовыйОтчет.Ссылка;
	
КонецФункции

Функция  ДатаАО (ФизЛицо, ДатаПрибытия) 

	ДатаДокумента = Неопределено;
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	АвансовыйОтчет.Дата КАК Дата
		|ИЗ
		|	Документ.АвансовыйОтчет КАК АвансовыйОтчет
		|ГДЕ
		|	АвансовыйОтчет.Организация = &Организация
		|	И АвансовыйОтчет.ПодотчетноеЛицо = &ФизЛицо
		|	И АвансовыйОтчет.Дата МЕЖДУ НАЧАЛОПЕРИОДА(&Дата, ДЕНЬ) И КОНЕЦПЕРИОДА(&Дата, ДЕНЬ)
		|
		|УПОРЯДОЧИТЬ ПО
		|	Дата";
	
	Запрос.УстановитьПараметр("Дата", ДатаПрибытия);
	Запрос.УстановитьПараметр("Организация", Объект.Организация);
	Запрос.УстановитьПараметр("ФизЛицо", ФизЛицо);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ДатаДокумента = ВыборкаДетальныеЗаписи.Дата;
	КонецЦикла;
	
	Если ДатаДокумента = Неопределено Тогда
		Возврат ДатаПрибытия;
	Иначе 
		Возврат ДатаДокумента + 1;
	КонецЕсли;
	
КонецФункции

Процедура ДобавитьСтрокуПоДаннымБилета(БилетСсылка, АвансовыйОтчет, Подразделение)
	
	РеквизитыБилетов = Новый Структура;
	РеквизитыБилетов.Вставить("НомерВходящегоДокумента", "НомерБилета");
	РеквизитыБилетов.Вставить("НаименованиеВходящегоДокумента", "ТипУслуги");
	РеквизитыБилетов.Вставить("Содержание", "ДеталиПоездки");
	РеквизитыБилетов.Вставить("Валюта");
	РеквизитыБилетов.Вставить("СтатьяДвиженияДенежныхСредств");   
	РеквизитыБилетов.Вставить("Подразделение", "Подразделение");
	РеквизитыБилетов.Вставить("АналитикаРасходов", "Подразделение");
	РеквизитыБилетов.Вставить("Контрагент", "КонтрагентПеревозчик");
  	РеквизитыБилетов.Вставить("АналитикаРасходов", "Подразделение");
	РеквизитыБилетов.Вставить("ДатаВходящегоДокумента", "тн_ДатаПокупки");
	
	ЗначенияРеквизитовБилета = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(БилетСсылка, РеквизитыБилетов);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	Операции.СтавкаНДС КАК СтавкаНДС,
	|	СУММА(ВЫБОР КОГДА Операции.ТипОперации = ЗНАЧЕНИЕ(Перечисление.ТипыОперацийСБилетами.Возврат)
	|	ТОГДА -Операции.СуммаНДС
	|	ИНАЧЕ Операции.СуммаНДС
	|	КОНЕЦ) КАК СуммаНДС,
	|	СУММА(ВЫБОР КОГДА Операции.ТипОперации = ЗНАЧЕНИЕ(Перечисление.ТипыОперацийСБилетами.Возврат)
	|	ТОГДА -Операции.Сумма
	|	ИНАЧЕ Операции.Сумма
	|	КОНЕЦ) КАК Сумма
	|ИЗ
	|	Документ.Бронирование.Операции КАК Операции
	|ГДЕ
	|	Операции.Ссылка = &Ссылка
	|СГРУППИРОВАТЬ ПО
	|	Операции.СтавкаНДС
	|ИМЕЮЩИЕ
	|	СУММА(ВЫБОР КОГДА Операции.ТипОперации = ЗНАЧЕНИЕ(Перечисление.ТипыОперацийСБилетами.Возврат)
	|	ТОГДА -Операции.Сумма
	|	ИНАЧЕ Операции.Сумма
	|	КОНЕЦ) > 0
	|";
	
	Запрос.УстановитьПараметр("Ссылка", БилетСсылка);
	Операции = Запрос.Выполнить().Выгрузить();
	
	КэшированныеЗначения = ПакетнаяОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруКэшируемыеЗначения();     
		
	СтруктураЗаполненияЦены = Новый Структура;
	СтруктураЗаполненияЦены.Вставить("ЦенаВключаетНДС", Истина);
	
	СтруктураДействий = Новый Структура;
	СтруктураДействий.Вставить("ПересчитатьСуммуСНДС", СтруктураЗаполненияЦены);
	
	ОбрабатываемыеСтроки = Новый Массив();
	
	Для каждого Операция Из Операции Цикл
		СтрокаТЧ = АвансовыйОтчет.ПрочиеРасходы.Добавить();
		СтрокаТЧ.ЭлектронныйБилет = БилетСсылка;
		ЗаполнитьЗначенияСвойств(СтрокаТЧ, ЗначенияРеквизитовБилета);
		СтрокаТЧ.СтатьяРасходов = тн_Интеграция_ERP_УХ_ПовтИсп.ЗначениеДополнительнойНастройкиПоОрганизации(АвансовыйОтчет.Дата, АвансовыйОтчет.Организация, "СтатьяРасходов_ЭлектронныеБилеты");
		СтрокаТЧ.СтавкаНДС = Операция.СтавкаНДС;
		СтрокаТЧ.СуммаНДС = Операция.СуммаНДС;
		СтрокаТЧ.Сумма = Операция.Сумма;
		СтрокаТЧ.Подразделение = Подразделение;
		Если СтрокаТЧ.СуммаНДС <> 0 Тогда
			СтрокаТЧ.БланкСтрогойОтчетности = Истина;
		КонецЕсли;
	    ОбрабатываемыеСтроки.Добавить(СтрокаТЧ);
		
	КонецЦикла;
	
	ПакетнаяОбработкаТабличнойЧастиСервер.ОбработатьСтрокиТЧ(
		ОбрабатываемыеСтроки,
		СтруктураДействий,
		АвансовыйОтчет.ПрочиеРасходы,
		КэшированныеЗначения);
	
КонецПроцедуры

Функция ПредставлениеСчетФактуры(СтрокаТЧ)
	
	Результат = "";
	
	Если СтрокаТЧ.БланкСтрогойОтчетности Тогда
		
		Если ЗначениеЗаполнено(СтрокаТЧ.НомерДокументаОплаты) Или ЗначениеЗаполнено(СтрокаТЧ.ДатаДокументаОплаты) Тогда
			Результат = НСтр("ru = 'Документ оплаты №';
							|en = 'AR/AP transaction No.'") + СтрокаТЧ.НомерДокументаОплаты + " " + НСтр("ru = 'от';
																										|en = 'dated'") + " " + Формат(СтрокаТЧ.ДатаДокументаОплаты, "ДЛФ=""Д""");
		ИначеЕсли ЗначениеЗаполнено(СтрокаТЧ.СчетФактура) Тогда
			Результат = Строка(СтрокаТЧ.СчетФактура);
		Иначе
			Результат = НСтр("ru = '<Указать реквизиты документа оплаты>';
							|en = '<Specify AR/AP transaction details>'");
		КонецЕсли;
		
	ИначеЕсли СтрокаТЧ.ПредъявленСФ Тогда
		
		Если ЗначениеЗаполнено(СтрокаТЧ.НомерСФ) Или ЗначениеЗаполнено(СтрокаТЧ.ДатаСФ) Тогда
			Результат = "Счет-фактура №" + СтрокаТЧ.НомерСФ + " " + НСтр("ru = 'от';
																		|en = 'dated'") + " " + Формат(СтрокаТЧ.ДатаСФ, "ДЛФ=""Д""");
		Иначе
			Результат = НСтр("ru = '<Указать реквизиты счета-фактуры>';
							|en = '<Specify tax invoice details>'");
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ПолучитьПодразделениеСотрудника(ФизическоеЛицо)
    
    Запрос = Новый Запрос;
    Запрос.Текст = 
        "ВЫБРАТЬ РАЗРЕШЕННЫЕ
        |	ТекущиеКадровыеДанныеСотрудников.тнПодразделение КАК Подразделение
        |ИЗ
        |	РегистрСведений.ТекущиеКадровыеДанныеСотрудников КАК ТекущиеКадровыеДанныеСотрудников
        |ГДЕ
        |	ТекущиеКадровыеДанныеСотрудников.ФизическоеЛицо = &ФизическоеЛицо
        |	И ТекущиеКадровыеДанныеСотрудников.ТекущаяОрганизация = &ТекущаяОрганизация";
    
    Запрос.УстановитьПараметр("ФизическоеЛицо", ФизическоеЛицо); 
	Запрос.УстановитьПараметр("ТекущаяОрганизация", Объект.Организация);
    
    Результат = Запрос.Выполнить();
    Выборка = Результат.Выбрать();
    
    Если Выборка.Следующий() Тогда
        Возврат Выборка.Подразделение;
    КонецЕсли;
    
    Возврат Неопределено;
    
КонецФункции 

&НаКлиенте
Процедура СоздатьАвансовыеОтчеты(Команда)  

	Отказ = Ложь;
		
	ПроверитьСуществующиеАвансовыеОтчеты();    
	СоздатьАвансовыеОтчетыНаСервере(); 
	Элементы.ТаблицаДанных.Обновить();

КонецПроцедуры

&НаСервере
Процедура ПроверитьСуществующиеАвансовыеОтчеты(); 
	
	СписокБронирований = Новый Массив;
	Для Каждого СтрокаТЗ Из Объект.ТаблицаДанных Цикл  
		Если СтрокаТЗ.Пометка Тогда
			СписокБронирований.Добавить(СтрокаТЗ.Бронирование);
		КонецЕсли;
	КонецЦикла;
	          	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	АвансовыйОтчет.Ссылка КАК Ссылка,
		|	АвансовыйОтчет.тн_Бронирование КАК тн_Бронирование
		|ИЗ
		|	Документ.АвансовыйОтчет КАК АвансовыйОтчет
		|ГДЕ
		|	АвансовыйОтчет.тн_Бронирование В(&СписокБронирований)
		|	И АвансовыйОтчет.Проведен
		|	И НЕ АвансовыйОтчет.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("СписокБронирований", СписокБронирований);
		
	ТЗСуществующихДокументов = Запрос.Выполнить().Выгрузить();
	
	Для Каждого СтрокаСуществующего Из ТЗСуществующихДокументов Цикл
		ТекстСообщения = СтрШаблон("Для документа %1 уже существует созданный %2", СтрокаСуществующего.тн_Бронирование, СтрокаСуществующего.Ссылка);
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, СтрокаСуществующего.Ссылка);  
		Для Каждого СтрокаДанных Из Объект.ТаблицаДанных Цикл 
			Если СтрокаДанных.Бронирование = СтрокаСуществующего.тн_Бронирование Тогда
				СтрокаДанных.Пометка = Ложь;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;

КонецПроцедуры

&НаСервере
Процедура ПровестиНаСервере()
	
	НепроведенныеДокументы = Новый Массив();
	Для Каждого СтрокаБронирований Из Объект.ТаблицаДанных Цикл
		Если СтрокаБронирований.Пометка И НЕ СтрокаБронирований.АвансовыйОтчет = Документы.АвансовыйОтчет.ПустаяСсылка() Тогда   
			Блокировка = Новый БлокировкаДанных();   
			ВыполненоУспешно = Ложь;
			ДокументСсылка = СтрокаБронирований.АвансовыйОтчет;
			ЭлементБлокировки = Блокировка.Добавить(ДокументСсылка.Метаданные().ПолноеИмя());
			ЭлементБлокировки.УстановитьЗначение("Ссылка", СтрокаБронирований.АвансовыйОтчет);
			
			НачатьТранзакцию();
			Попытка    
				Блокировка.Заблокировать();
				
				ДокументОбъект = ДокументСсылка.ПолучитьОбъект();
				Если ДокументОбъект.ПроверитьЗаполнение() Тогда
					РежимПроведения = РежимПроведенияДокумента.Неоперативный;
					Если ДокументОбъект.Дата >= НачалоДня(ТекущаяДатаСеанса())
						И ДокументСсылка.Метаданные().ОперативноеПроведение = Метаданные.СвойстваОбъектов.ОперативноеПроведение.Разрешить Тогда
						
						РежимПроведения = РежимПроведенияДокумента.Оперативный;
					КонецЕсли;
					
					ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение, РежимПроведения);   
										
					СоздатьДокументыЗаписьКнигиПокупок(ДокументОбъект);

					ВыполненоУспешно = Истина; 
					СтрокаБронирований.Пометка = Ложь;  	
				Иначе
					ПредставлениеОшибки = СтрШаблон("Поля документа %1 не заполнены. Документ не проведен", СтрокаБронирований.АвансовыйОтчет);
					ВызватьИсключение ПредставлениеОшибки;
				КонецЕсли;
				ЗафиксироватьТранзакцию();
			Исключение
				ОтменитьТранзакцию();
				Если ПредставлениеОшибки = "" Тогда
					ПредставлениеОшибки = ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке());    
				КонецЕсли;	
				ЗаписьЖурналаРегистрации("Проведение документа Авансовый отчет", УровеньЖурналаРегистрации.Ошибка, Документы.АвансовыйОтчет, ДокументОбъект, 
				"Не получилось провести документ Авансовый отчет", РежимТранзакцииЗаписиЖурналаРегистрации.Транзакционная);
				 ОбщегоНазначения.СообщитьПользователю(ПредставлениеОшибки, СтрокаБронирований.АвансовыйОтчет);
			КонецПопытки;
			
		КонецЕсли;	
	КонецЦикла;
			
КонецПроцедуры

&НаКлиенте
Процедура Провести(Команда)
	ПровестиНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура СписокОтметитьВсе(Команда)
	
	Для Каждого Строка Из Объект.ТаблицаДанных Цикл
		Строка.Пометка = Истина;	
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокСнятьВсе(Команда)
	
	Для Каждого Строка Из Объект.ТаблицаДанных Цикл
		Строка.Пометка = Ложь;	
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаДанныхБронированиеОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, ВыборДобавлением, СтандартнаяОбработка)   
	
	Если ВыбранноеЗначение = Неопределено Тогда
        Возврат;
    КонецЕсли;
        
   ФизЛицоИзБронирования =  ПолучитьФизЛицоИзБронированияНаСервере(ВыбранноеЗначение);
   Элементы.ТаблицаДанных.ТекущиеДанные.ФизЛицо = ФизЛицоИзБронирования;
    
   // Обновляем отображение таблицы
   Элементы.ТаблицаДанных.Обновить(); 
	
КонецПроцедуры

  &НаСервереБезКонтекста
Функция ПолучитьФизЛицоИзБронированияНаСервере(Бронирование)
    
   ФизЛицо = ОбщегоНазначенияУТВызовСервера.ЗначениеРеквизитаОбъекта(Бронирование, "Сотрудник");
   Возврат ФизЛицо;
    
КонецФункции
